In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
from sqlalchemy import text
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [2]:
# 1. Establish a connection between Python and the Sakila database.

In [7]:
sd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+sd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [4]:
# 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) 
# from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

# engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
# month: an integer representing the month for which rental data is to be retrieved.
# year: an integer representing the year for which rental data is to be retrieved.

In [9]:
def rentals_month(engine,month,year):
    with engine.connect() as connection:
        query = text(f'''SELECT *, MONTH(rental_date), YEAR(rental_date) 
                    FROM rental 
                    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};''')     
        result = connection.execute(query)
        df1 = pd.DataFrame(result.all())
         
    return df1

In [11]:
df1 = rentals_month(engine,5,2005)

In [13]:
df1

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,MONTH(rental_date),YEAR(rental_date)
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,5,2005
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,5,2005
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,5,2005
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,5,2005
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,5,2005
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,5,2005
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,5,2005
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,5,2005
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,5,2005
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,5,2005

In [15]:
rentals_month(engine,4,2003)

Empty DataFrame
Columns: []
Index: []

In [42]:
# 3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input 
# along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id 
# during the selected month and year.

# The function should also include the month and year as parameters and use them to name the new column according to the month and year, 
# for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

# Hint: Consider making use of pandas groupby()

In [25]:
def rental_count_month(df, month, year):
    df2 = df1.groupby('customer_id')[["rental_id"]].count()
    df2 = df2.rename(columns = {"rental_id": f"{month}_{year}_rentals"})
    return df2

In [27]:
rental_count_month(df1, 5, 2005)

             5_2005_rentals
customer_id
1                         2
2                         1
3                         2
5                         3
6                         3
...                     ...
594                       4
595                       1
596                       6
597                       2
599                       1

[520 rows x 1 columns]

In [29]:
# 4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer 
# in different months and years. The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.

def compare_rentals(df1,df2):
    df3 = df1.join(df2, how = 'inner')
    df3['difference'] = df3.iloc[:,1] - df3.iloc[:,0]
    return df3

In [31]:
compare_rentals(df1,df2)

NameError: name 'df2' is not defined